In [4]:
import pandas as pd

disease_data = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'name': ["John Doe", "Jane Smith", "Michael Brown", "Sara White", "David Lee", "Emily Clark", "Chris Turner", "Nancy Wright", "Andrew Hill", "Jessica Green"],
    'age': [34, 28, 45, 50, 36, 29, 41, 33, 47, 39],
    'gender': ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F"],
    'disease': ["Diabetes", "Hypertension", "Asthma", "COPD", "Arthritis", "Heart Disease", "Stroke", "Cancer", "Obesity", "Kidney Disease"],
    'severity': ["Moderate", "Mild", "Severe", "Moderate", "Mild", "Severe", "Moderate", "Mild", "Severe", "Moderate"],
    'treatment_plan': ["Insulin", "Lifestyle Change", "Inhaler", "Medication", "Physical Therapy", "Surgery", "Rehabilitation", "Chemotherapy", "Diet Plan", "Dialysis"],
    'doctor_assigned': ["Dr. Patel", "Dr. Johnson", "Dr. Smith", "Dr. Gupta", "Dr. Brown", "Dr. Clark", "Dr. Lee", "Dr. Turner", "Dr. Wright", "Dr. Green"],
    'admission_date': ["2023-01-15", "2023-02-20", "2023-03-10", "2023-04-05", "2023-05-18", "2023-06-22", "2023-07-30", "2023-08-14", "2023-09-25", "2023-10-31"],
    'discharge_date': ["2023-01-25", "2023-02-28", "2023-03-20", "2023-04-12", "2023-05-25", "2023-06-30", "2023-08-05", "2023-08-24", "2023-10-05", "2023-11-10"]
}

disease_df = pd.DataFrame(disease_data)

In [1]:
import matplotlib.pyplot as plt

In [ ]:
plt.figure(figsize=(10, 6)) 
disease_counts = disease_df['disease'].value_counts() 
disease_counts.plot(kind='bar', color='skyblue') 

plt.title('Disease Count') 
plt.xlabel('Disease') 
plt.ylabel('Count') 
plt.xticks(rotation=45) 
plt.grid(axis='y')
plt.tight_layout()
plt.show()

In [6]:
# Mapping severity to numeric values for scatter plot 
severity_mapping = {"Mild": 1, "Moderate": 2, "Severe": 3} 
disease_df['severity_numeric'] = disease_df['severity'].map(severity_mapping)

HANDLING THE 0 , NaN and EMPTY

In [17]:
import pandas as pd
import numpy as np

# Example DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Salary': [50000, 0, np.nan, 30000]}
df = pd.DataFrame(data)

df

      Name   Salary
0    Alice  50000.0
1      Bob      0.0
2  Charlie      NaN
3    David  30000.0

In [18]:
# Identify problematic rows
print(df[df['Salary'].isnull()])  # Check for NaN
print(df[df['Salary'] == 0])      # Check for zeros

      Name  Salary
2  Charlie     NaN
  Name  Salary
1  Bob     0.0

In [19]:
# Replace NaN and 0 with "TBD"
df['Salary'] = df['Salary'].replace(0, np.nan)  # Treat 0 as NaN
df['Salary'] = df['Salary'].fillna("TBD")      # Replace NaN with "TBD"

In [20]:
df

      Name   Salary
0    Alice  50000.0
1      Bob      TBD
2  Charlie      TBD
3    David  30000.0

In [22]:
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')  # Convert non-numeric to NaN
current_avg_salary = df['Salary'].mean()  # Calculate mean of numeric values
print(current_avg_salary)

40000.0

In [23]:
num_tbd = df['Salary'].isnull().sum()

In [ ]:
print(num_tbd)

2

In [25]:
unique_salaries = np.random.choice(range(30000, 60000), size=num_tbd, replace=False)

In [26]:
df.loc[df['Salary'].isnull(), 'Salary'] = unique_salaries

In [27]:
df

      Name   Salary
0    Alice  50000.0
1      Bob  50434.0
2  Charlie  56183.0
3    David  30000.0

In [28]:
post_avg_salary = df['Salary'].mean()
print(post_avg_salary)

46654.25